
//2. Даны два числа. Показать большее и меньшее число

int a = 20, b = 110;

if (a > b)
{
    Console.WriteLine("a = " + a + " > " + "b = " + b);
}
else
{
    Console.WriteLine("a = " + a + " < " + "b = " + b);
}
